# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11-seg instance segmentation model. For Usage examples see https://docs.ultralytics.com/tasks/segment

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n-seg.yaml' will call yolo11-seg.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 355 layers, 2876848 parameters, 2876832 gradients, 10.5 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 355 layers, 10113248 parameters, 10113232 gradients, 35.8 GFLOPs
  m: [0.50, 1.00, 512] # summary: 445 layers, 22420896 parameters, 22420880 gradients, 123.9 GFLOPs
  l: [1.00, 1.00, 512] # summary: 667 layers, 27678368 parameters, 27678352 gradients, 143.0 GFLOPs
  x: [1.00, 1.50, 512] # summary: 667 layers, 62142656 parameters, 62142640 gradients, 320.2 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, ReNLANRepLKBlock, [128, 64, 32]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 3, ReNLANRepLKBlock, [256, 128, 64]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, ReNLANRepLKBlock, [512, 256, 128]]
  - [-1, 1, Conv, [512, 3, 2]]  # 7-P5/32
  - [-1, 3, ReNLANRepLKBlock, [512, 512, 256]]
  - [-1, 1, SPPF, [512, 5]]  # 9
  - [-1, 2, C2PSA, [512]] # 10
# YOLOv8.0n head
head:
  - [-1, 1, Conv, [512, 1, 1]] # 11
  - [4, 1, Conv, [512, 1, 1]] # 12
  - [[-1, 6, -2], 1, Zoom_cat, []]  # 13 cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 14

  - [-1, 1, Conv, [256, 1, 1]] # 15
  - [2, 1, Conv, [256, 1, 1]] # 16
  - [[-1, 4, -2], 1, Zoom_cat, []]  # 17  cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 18 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 19
  - [[-1, 15], 1, SDI, []]  # 20 cat head P4
  - [-1, 2, C3k2, [512, False]] # 21 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 22
  - [[-1, 11], 1, SDI, []]  # 23 cat head P5
  - [-1, 2, C3k2, [1024, True]] # 24 (P5/32-large)

  - [[4, 6, 8], 1, DynamicScalSeq, [256]] # 25 args[inchane]
  - [[18, -1], 1, attention_model, [256]] # 26

  - [[26, 21, 24], 1, Segment, [nc, 32, 256]] # Segment(P3, P4, P5)
